c220g5_not_consolidated_4core_4iothread_1/default/run2.txt
# run=2/10
# 2026-04-06T00:49:33-05:00
# cmd: taskset -c 1-39 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            614278
        write:                           159840
        other:                           82040
        total:                           856158
    transactions:                        38163  (635.53 per sec.)
    queries:                             856158 (14257.64 per sec.)
    ignored errors:                      5714   (95.16 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      635.5304
    time elapsed:                        60.0491s
    total number of events:              38163

Latency (ms):
         min:                                    3.50
         avg:                                   50.33
         max:                                  292.74
         95th percentile:                      106.75
         sum:                              1920620.75

Threads fairness:
    events (avg/stddev):           1192.5938/19.51
    execution time (avg/stddev):   60.0194/0.01